<template>
  <div class="page">
    <h2>Зачем?</h2>
    <p>
      Цель проекта (помимо улучшения навыков и удовольствия от его создания) -
      решить определенные проблемы в паре. Так как мы с девушкой работаем (а
      значит и отдыхаем) по разным графикам, домашние дела мы делаем отдельно
      друг от друга. А то редкое время, что нам удается побыть вместе, мы не
      тратим на готовку и уборку, а уделяем друг другу. И чтобы не возникало
      фраз "Ты отдыхал/отдыхала два дня подряд, ничего не сделал/сделала по
      дому, мог/могла хотя бы отмыть ванну!?" (утрировано), мы решили что было
      бы неплохо где-нибудь записывать то, что мы делаем по дому, чтобы каждый
      из нас видел как много всего мы делаем и не было обесценивания. Мы успешно
      вели записи домашних дел в нашем закрытом телеграм канале, пока я не решил
      сделать этот сайт для меня и моей девушки :)
    </p>
    <h2>Кому?</h2>
    <p>
      Несмотря на то, что в проекте есть регистрация, он сделан в первую очередь
      для меня и моей девушки. Но, очевидно, он подойдет для любой пары, где
      есть схожая проблема и желание её решить :)
    </p>
    <h2>Как?</h2>
    <p>
      Вкладка "Добавить": добавить новые карточки с выполненными делами по дому.
      Например: вытер пыль, помыл унитаз, очистил плиту. Один день - одна
      карточка со списком дел.
    </p>
    <p>
      Вкладка "История": все ваши карточки с домашними делами. Здесь их можно
      редактировать или полностью удалять.
    </p>
    <p>
      Вкладка "Профиль": здесь вы можете заменить ваш ник и аватарку. Данные
      сохраняются на сервере.
    </p>
    <h2>А что под капотом?</h2>
    <p>
      Проект сделан на Vue 2.6.11 (в т.ч. vuex, vue-router). Для красоты
      переходов подключил vuetify. Обрезка фотографий сделана с помощью
      vue-croppie. На бэке firebase.
      <a
        href="https://github.com/AndreyKudinov63/sweethome"
        target="_blank"
        rel="noopener noreferrer"
        >Репозиторий проекта на github.</a
      >
    </p>
  </div>
</template>

<style scoped>
.page {
  display: flex;
  flex-direction: column;
  align-items: center;
  width: 500px;
  font-family: "Source Sans Pro";
  font-style: normal;
  font-weight: 600;
  font-size: 16px;
  line-height: 20px;
  color: #0a467e;
  padding: 20px 0;
}
@media all and (max-width: 768px) {
  .page {
    width: 90%;
  }
}
h2 {
  font-size: 20px;
  line-height: 24px;
  margin: 10px 0;
}
p {
  text-align: justify;
  margin-bottom: 10px;
}
</style>
